MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC131SC2AE/mcu.h
#define SYS_ALT_MFP3_PC7_PWM0BK1_Pos            29                                          /*!< GCR_T::ALT_MFP3: PC7_PWM0BK1 Position */
#define SYS_ALT_MFP3_PC7_PWM0BK1_Msk            (1ul << SYS_ALT_MFP3_PC7_PWM0BK1_Pos)       /*!< GCR_T::ALT_MFP3: PC7_PWM0BK1 Mask */

#define SYS_ALT_MFP3_PC6_PWM0BK0_Pos            28                                          /*!< GCR_T::ALT_MFP3: PC6_PWM0BK0 Position */
#define SYS_ALT_MFP3_PC6_PWM0BK0_Msk            (1ul << SYS_ALT_MFP3_PC6_PWM0BK0_Pos)       /*!< GCR_T::ALT_MFP3: PC6_PWM0BK0 Mask */

#define SYS_ALT_MFP3_PB11_PWM04_Pos             24                                          /*!< GCR_T::ALT_MFP3: PB11_PWM04 Position */
#define SYS_ALT_MFP3_PB11_PWM04_Msk             (1ul << SYS_ALT_MFP3_PB11_PWM04_Pos)        /*!< GCR_T::ALT_MFP3: PB11_PWM04 Mask */

#define SYS_ALT_MFP3_PB15_BPWM15_Pos            23                                          /*!< GCR_T::ALT_MFP3: PFB15_BPWM15 Position */
#define SYS_ALT_MFP3_PB15_BPWM15_Msk            (1ul << SYS_ALT_MFP3_PB15_BPWM15_Pos)       /*!< GCR_T::ALT_MFP3: PB15_BPWM15 Mask */

#define SYS_ALT_MFP3_PF8_BPWM14_Pos             22                                          /*!< GCR_T::ALT_MFP3: PF8_BPWM14 Position */
#define SYS_ALT_MFP3_PF8_BPWM14_Msk             (1ul << SYS_ALT_MFP3_PF8_BPWM14_Pos)        /*!< GCR_T::ALT_MFP3: PF8_BPWM14 Mask */

#define SYS_ALT_MFP3_PB12_BPWM13_Pos            21                                          /*!< GCR_T::ALT_MFP3: PB12_BPWM13 Position */
#define SYS_ALT_MFP3_PB12_BPWM13_Msk            (1ul << SYS_ALT_MFP3_PB12_BPWM13_Pos)       /*!< GCR_T::ALT_MFP3: PB12_BPWM13 Mask */

#define SYS_ALT_MFP3_PB8_BPWM12_Pos             20                                          /*!< GCR_T::ALT_MFP3: PB8_BPWM12 Position */
#define SYS_ALT_MFP3_PB8_BPWM12_Msk             (1ul << SYS_ALT_MFP3_PB8_BPWM12_Pos)        /*!< GCR_T::ALT_MFP3: PB8_BPWM12 Mask */

#define SYS_ALT_MFP3_PD6_BPWM11_Pos             19                                          /*!< GCR_T::ALT_MFP3: PD6_BPWM11 Position */
#define SYS_ALT_MFP3_PD6_BPWM11_Msk             (1ul << SYS_ALT_MFP3_PD6_BPWM11_Pos)        /*!< GCR_T::ALT_MFP3: PD6_BPWM11 Mask */

#define SYS_ALT_MFP3_PD7_BPWM10_Pos             18                                          /*!< GCR_T::ALT_MFP3: PD7_BPWM10 Position */
#define SYS_ALT_MFP3_PD7_BPWM10_Msk             (1ul << SYS_ALT_MFP3_PD7_BPWM10_Pos)        /*!< GCR_T::ALT_MFP3: PD7_BPWM10 Mask */

#define SYS_ALT_MFP3_PD14_BPWM05_Pos            17                                          /*!< GCR_T::ALT_MFP3: PD14_BPWM05 Position */
#define SYS_ALT_MFP3_PD14_BPWM05_Msk            (1ul << SYS_ALT_MFP3_PD14_BPWM05_Pos)       /*!< GCR_T::ALT_MFP3: PD14_BPWM05 Mask */

#define SYS_ALT_MFP3_PD15_BPWM04_Pos            16                                          /*!< GCR_T::ALT_MFP3: PD15_BPWM04 Position */
#define SYS_ALT_MFP3_PD15_BPWM04_Msk            (1ul << SYS_ALT_MFP3_PD15_BPWM04_Pos)       /*!< GCR_T::ALT_MFP3: PD15_BPWM04 Mask */

#define SYS_ALT_MFP3_PC3_BPWM03_Pos             15                                          /*!< GCR_T::ALT_MFP3: PC3_BPWM03 Position */
#define SYS_ALT_MFP3_PC3_BPWM03_Msk             (1ul << SYS_ALT_MFP3_PC3_BPWM03_Pos)        /*!< GCR_T::ALT_MFP3: PC3_BPWM03 Mask */

#define SYS_ALT_MFP3_PC2_BPWM02_Pos             14                                          /*!< GCR_T::ALT_MFP3: PC2_BPWM02 Position */
#define SYS_ALT_MFP3_PC2_BPWM02_Msk             (1ul << SYS_ALT_MFP3_PC2_BPWM02_Pos)        /*!< GCR_T::ALT_MFP3: PC2_BPWM02 Mask */

#define SYS_ALT_MFP3_PC1_BPWM01_Pos             13                                          /*!< GCR_T::ALT_MFP3: PC1_BPWM01 Position */
#define SYS_ALT_MFP3_PC1_BPWM01_Msk             (1ul << SYS_ALT_MFP3_PC1_BPWM01_Pos)        /*!< GCR_T::ALT_MFP3: PC1_BPWM01 Mask */

#define SYS_ALT_MFP3_PC0_BPWM00_Pos             12                                          /*!< GCR_T::ALT_MFP3: PC0_BPWM00 Position */
#define SYS_ALT_MFP3_PC0_BPWM00_Msk             (1ul << SYS_ALT_MFP3_PC0_BPWM00_Pos)        /*!< GCR_T::ALT_MFP3: PC0_BPWM00 Mask */

#define SYS_ALT_MFP3_PF5_PWM15_Pos              11                                          /*!< GCR_T::ALT_MFP3: PF5_PWM15 Position */
#define SYS_ALT_MFP3_PF5_PWM15_Msk              (1ul << SYS_ALT_MFP3_PF5_PWM15_Pos)         /*!< GCR_T::ALT_MFP3: PF5_PWM15 Mask */

#define SYS_ALT_MFP3_PF4_PWM14_Pos              10                                          /*!< GCR_T::ALT_MFP3: PF5_PWM14 Position */
#define SYS_ALT_MFP3_PF4_PWM14_Msk              (1ul << SYS_ALT_MFP3_PF4_PWM14_Pos)         /*!< GCR_T::ALT_MFP3: PF5_PWM14 Mask */

#define SYS_ALT_MFP3_PA11_PWM13_Pos             9                                           /*!< GCR_T::ALT_MFP3: PA11_PWM13 Position */
#define SYS_ALT_MFP3_PA11_PWM13_Msk             (1ul << SYS_ALT_MFP3_PA11_PWM13_Pos)        /*!< GCR_T::ALT_MFP3: PA11_PWM13 Mask */

#define SYS_ALT_MFP3_PA10_PWM12_Pos             8                                           /*!< GCR_T::ALT_MFP3: PA10_PWM12 Position */
#define SYS_ALT_MFP3_PA10_PWM12_Msk             (1ul << SYS_ALT_MFP3_PA10_PWM12_Pos)        /*!< GCR_T::ALT_MFP3: PA10_PWM12 Mask */

#define SYS_ALT_MFP3_PA3_PWM11_Pos              7                                           /*!< GCR_T::ALT_MFP3: PA3_PWM11 Position */
#define SYS_ALT_MFP3_PA3_PWM11_Msk              (1ul << SYS_ALT_MFP3_PA3_PWM11_Pos)         /*!< GCR_T::ALT_MFP3: PA3_PWM11 Mask */

#define SYS_ALT_MFP3_PA2_PWM10_Pos              6                                           /*!< GCR_T::ALT_MFP3: PA2_PWM10 Position */
#define SYS_ALT_MFP3_PA2_PWM10_Msk              (1ul << SYS_ALT_MFP3_PA2_PWM10_Pos)         /*!< GCR_T::ALT_MFP3: PA2_PWM10 Mask */

#define SYS_ALT_MFP3_PA1_PWM05_Pos              5                                           /*!< GCR_T::ALT_MFP3: PA1_PWM05 Position */
#define SYS_ALT_MFP3_PA1_PWM05_Msk              (1ul << SYS_ALT_MFP3_PA1_PWM05_Pos)         /*!< GCR_T::ALT_MFP3: PA1_PWM05 Mask */

#define SYS_ALT_MFP3_PA0_PWM04_Pos              4                                           /*!< GCR_T::ALT_MFP3: PA0_PWM04 Position */
#define SYS_ALT_MFP3_PA0_PWM04_Msk              (1ul << SYS_ALT_MFP3_PA0_PWM04_Pos)         /*!< GCR_T::ALT_MFP3: PA0_PWM04 Mask */

/* GCR ALTMFP4 Bit Field Definitions */
#define SYS_ALT_MFP4_PA7_VREF_Pos               14                                          /*!< GCR_T::ALT_MFP4: PA7_VREF Position */
#define SYS_ALT_MFP4_PA7_VREF_Msk               (1ul << SYS_ALT_MFP4_PA7_VREF_Pos)          /*!< GCR_T::ALT_MFP4: PA7_VREF Mask */

